---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.SetColor(Autodesk.Revit.DB.ColorWithTransparency)
source: html/5b90c02e-8b63-cd76-5951-fbb60327a420.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.SetColor Method

Sets the vertex's color.

## Syntax (C#)
```csharp
public void SetColor(
	ColorWithTransparency color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.ColorWithTransparency`) - The vertex's color.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null